/*
 Navicat Premium Data Transfer

 Source Server         : mysql
 Source Server Type    : MySQL
 Source Server Version : 80030
 Source Host           : localhost:3306
 Source Schema         : archindicators

 Target Server Type    : MySQL
 Target Server Version : 80030
 File Encoding         : 65001

 Date: 12/08/2022 16:07:25
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for constru_property
-- ----------------------------
DROP TABLE IF EXISTS `constru_property`;
CREATE TABLE `constru_property`  (
  `股票代码` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `企业名称` varchar(45) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `总资产` double NOT NULL,
  `企业成立年限` int(0) NOT NULL,
  `成立年份` int(0) NOT NULL,
  `员工总数` int(0) NOT NULL,
  `资产负债率` double NOT NULL,
  `总资产周转率` double NOT NULL,
  `净利润增长率` double NOT NULL,
  `营业净利润率` double NOT NULL,
  `研发投入费用` double NOT NULL,
  `研发投入占营业收入比例(%)` double NOT NULL,
  `研发人员` int(0) NOT NULL,
  `研发项目个数` int(0) NOT NULL,
  `专利数` int(0) NOT NULL,
  `硕士及以上人员数量` int(0) NOT NULL,
  `国家级获奖` int(0) NOT NULL,
  `研发中心数量` int(0) NOT NULL,
  `数字化创新平台数` int(0) NOT NULL,
  `数字化业务板块数` int(0) NOT NULL,
  `联合高等院校课题研发数` int(0) NOT NULL,
  `互联网云平台运用数量` int(0) NOT NULL,
  `成果转化数` int(0) NOT NULL,
  `一级技术词频数` int(0) NOT NULL,
  `二级技术词频数` int(0) NOT NULL,
  `三级技术词频数` int(0) NOT NULL,
  `业务板块数量（多元化情况）` int(0) NOT NULL,
  `组织结构中是否有专门的数字化部门` tinyint(0) NOT NULL,
  `组织内部是否具有专门的项目管理系统` tinyint(0) NOT NULL,
  `是否与数字化类型的企业有合作、收购、投资关系（从年报中获取）` tinyint(0) NOT NULL,
  `是否为国家认定高新技术企业` tinyint(0) NOT NULL,
  `企业年报中是否有提及数字化战略的相关内容？` tinyint(0) NOT NULL,
  `企业年报中是否有专项数字化转型报告` tinyint(0) NOT NULL,
  `企业远景、目标、定位中是否具有数字化、大数据、智能化、信息化等词语` tinyint(0) NOT NULL,
  `企业战略职能中是否具有专门数字化业务部门` tinyint(0) NOT NULL,
  `企业业务中是否运用信息化技术系统` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `企业年报中是否有提及“政策”或相关对于数字化转型政策支持的词语` int(0) NOT NULL,
  `企业年报中是否有提及“行业”、“市场”、“需求”或相关对于数字化转型外部驱动的词语` int(0) NOT NULL,
  `装配式建筑项目数` int(0) NOT NULL,
  `完成装配式建筑面积` int(0) NOT NULL,
  `装配式建筑产业基地数量` int(0) NOT NULL,
  `拥有建筑机器人数量` int(0) NOT NULL,
  `智慧工地数量占比` int(0) NOT NULL,
  `5G技术应用工地数量` int(0) NOT NULL,
  `运用BIM技术合同额` int(0) NOT NULL,
  `采用BIM技术项目个数` int(0) NOT NULL,
  `智能建造平台数量` int(0) NOT NULL,
  `采用电子签名/签章项目占比` int(0) NOT NULL,
  `拥有电子化工程档案项目占比` int(0) NOT NULL,
  `A、智能塔吊` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `施工设施应用个数` int(0) NOT NULL,
  `企业业务中是否运用信息化技术系统个数` int(0) NOT NULL,
  `年份` int(0) NOT NULL,
  PRIMARY KEY (`股票代码`) USING BTREE,
  UNIQUE INDEX `id_UNIQUE`(`股票代码`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of constru_property
-- ----------------------------
INSERT INTO `constru_property` VALUES ('000010', '美丽生态', 4291660034.27, 30, 1989, 339, 0.824373, 0.441105, -0.780202, 0.066626, 1690182.58, 0.09, 18, 0, 0, 13, 0, 0, 0, 0, 0, 0, 0, 29, 4, 2, 6, 0, 0, 0, 1, 1, 0, 0, 0, 'A', 25, 58, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ACEFG', 5, 1, 2019);
INSERT INTO `constru_property` VALUES ('000065', '北方国际', 14746104215.47, 25, 1994, 1710, 0.630137, 0.75004, 0.690471, 0.066868, 133263745.6, 1.2, 103, 7, 0, 240, 0, 0, 1, 0, 4, 0, 0, 34, 16, 3, 19, 0, 0, 0, 1, 1, 0, 1, 0, 'A', 2, 164, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'C', 1, 1, 2019);
INSERT INTO `constru_property` VALUES ('000498', '山东路桥', 32061226492.73, 27, 1992, 10394, 0.742626, 0.725502, 0.170012, 0.035223, 335411501.46, 1.44, 920, 0, 147, 192, 8, 5, 8, 3, 15, 3, 0, 29, 3, 1, 18, 1, 0, 1, 1, 0, 0, 1, 1, 'A', 10, 352, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ACEFG', 5, 1, 2019);
INSERT INTO `constru_property` VALUES ('000628', '高新发展', 5881496980.76, 29, 1990, 1137, 0.812086, 0.56293, 3.301389, 0.032158, 0, 0, 0, 0, 0, 50, 0, 0, 0, 0, 0, 0, 0, 54, 0, 18, 3, 0, 1, 1, 1, 1, 0, 1, 0, 'A、D', 5, 90, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'C', 1, 3, 2019);
INSERT INTO `constru_property` VALUES ('000928', '中钢国际', 18326440169.53, 18, 2001, 1884, 0.715311, 0.731952, 4.621479, 0.04009, 55168708.19, 0.41, 366, 10, 188, 494, 2, 2, 29, 4, 24, 2, 32, 25, 6, 4, 7, 1, 1, 1, 1, 1, 0, 1, 1, 'A', 12, 114, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 1, 2019);
INSERT INTO `constru_property` VALUES ('002051', '中工国际', 21999483304.15, 25, 1994, 5761, 0.49928, 0.484411, 0.176836, 0.098245, 606462866.88, 5.69, 2505, 0, 88, 1510, 0, 0, 4, 0, 0, 6, 2, 32, 9, 10, 3, 0, 1, 1, 1, 0, 0, 0, 1, 'A、B、D', 22, 131, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 5, 2019);
INSERT INTO `constru_property` VALUES ('002060', '粤 水 电', 26047764064.96, 18, 2001, 4220, 0.869274, 0.42781, 2.047105, 0.022039, 351823966.5, 3.16, 576, 27, 43, 0, 4, 0, 0, 0, 0, 4, 0, 25, 2, 10, 0, 0, 1, 1, 1, 0, 0, 1, 0, 'A、B、C', 6, 161, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'AEFG', 4, 5, 2019);
INSERT INTO `constru_property` VALUES ('002061', '浙江交科', 33798055234.94, 18, 2001, 6968, 0.748079, 0.855002, 0.12358, 0.026636, 381976720.08, 1.32, 979, 0, 26, 251, 0, 0, 9, 2, 0, 4, 65, 34, 4, 2, 5, 1, 1, 1, 1, 0, 0, 1, 1, 'A、B、D', 11, 149, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'AEFG', 4, 5, 2019);
INSERT INTO `constru_property` VALUES ('002062', '宏润建设', 15731608288.1, 27, 1992, 2163, 0.788431, 0.759195, -0.015817, 0.032464, 331896963.8, 2.78, 461, 40, 15, 0, 1, 1, 1, 2, 0, 0, 0, 20, 1, 2, 7, 1, 1, 1, 1, 1, 0, 1, 1, 'A、B、C、D', 7, 77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ACEFG', 5, 7, 2019);
INSERT INTO `constru_property` VALUES ('002116', '中国海诚', 4303104980.31, 28, 1991, 4866, 0.676747, 1.297047, -2.6278, 0.010501, 194777681.5, 3.49, 885, 8, 0, 815, 0, 0, 0, 0, 0, 4, 0, 34, 5, 9, 4, 0, 1, 1, 1, 1, 0, 1, 0, 'A、B、D', 13, 223, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 5, 2019);
INSERT INTO `constru_property` VALUES ('002135', '东南网架', 11443472566.34, 31, 1988, 5338, 0.614909, 0.78441, -0.286258, 0.02953, 400999832.89, 4.47, 897, 33, 29, 0, 1, 2, 15, 0, 12, 8, 0, 31, 8, 36, 5, 1, 1, 1, 1, 1, 1, 1, 1, 'A、B、C、D', 21, 176, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 7, 2019);
INSERT INTO `constru_property` VALUES ('002140', '东华科技', 6673569147.39, 13, 2006, 1228, 0.662781, 0.676998, 0.271824, 0.039765, 162400922.8, 3.59, 215, 4, 14, 449, 3, 2, 3, 0, 0, 23, 0, 50, 21, 17, 6, 1, 1, 1, 1, 1, 1, 1, 1, 'A、B、C、D', 46, 370, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 7, 2019);
INSERT INTO `constru_property` VALUES ('002200', 'ST云投', 3614107820.22, 21, 1998, 359, 0.877662, 0.188767, -0.468516, 0.096309, 3792004.15, 0, 0, 3, 0, 29, 0, 0, 0, 0, 0, 5, 0, 14, 6, 4, 4, 0, 1, 1, 1, 0, 0, 1, 0, 'A、D', 8, 59, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'C', 1, 3, 2019);
INSERT INTO `constru_property` VALUES ('002307', '北新路桥', 27575087546.38, 21, 1998, 4243, 0.860592, 0.403493, 0.248148, 0.004338, 28493311.03, 0.26, 43, 0, 50, 92, 4, 1, 2, 0, 0, 3, 0, 19, 0, 2, 4, 0, 0, 0, 1, 0, 0, 0, 0, 'A', 12, 106, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'C', 1, 1, 2019);
INSERT INTO `constru_property` VALUES ('002310', '东方园林', 43811501216.44, 24, 1995, 3388, 0.710368, 0.185641, 266.670709, 0.005424, 237252242.11, 2.92, 866, 0, 58, 223, 2, 1, 5, 0, 97, 4, 0, 52, 4, 2, 8, 0, 1, 1, 1, 0, 0, 1, 0, 'A、B、D', 34, 181, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ACEFG', 5, 5, 2019);
INSERT INTO `constru_property` VALUES ('002431', '棕榈股份', 17195137922.78, 21, 1998, 1269, 0.723633, 0.157534, 0, -0.389132, 113515680.83, 4.19, 173, 22, 5, 112, 1, 0, 13, 4, 0, 9, 0, 33, 1, 14, 4, 1, 1, 1, 1, 1, 1, 1, 1, 'A、B、C、D', 12, 89, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ACEFG', 5, 7, 2019);
INSERT INTO `constru_property` VALUES ('002469', '三维化学', 1654501064.81, 21, 1998, 448, 0.190786, 0.381389, 1.080644, 0.125708, 31767348.79, 5.03, 195, 1, 2, 55, 0, 0, 0, 1, 3, 1, 0, 29, 5, 1, 5, 0, 1, 1, 1, 1, 0, 1, 0, 'A', 11, 126, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ACEFG', 5, 1, 2019);
INSERT INTO `constru_property` VALUES ('002541', '鸿路钢构', 12752502108.24, 12, 2007, 11113, 0.61278, 0.843358, 0.312323, 0.051987, 303585750.13, 2.82, 978, 0, 26, 0, 0, 0, 8, 3, 0, 4, 0, 24, 12, 25, 6, 1, 1, 1, 1, 1, 0, 1, 1, 'A、B、C、D', 12, 101, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCDEFG', 7, 7, 2019);
INSERT INTO `constru_property` VALUES ('002542', '中化岩土', 9008290719.83, 15, 2004, 2005, 0.539615, 0.455167, 0.228979, 0.060257, 121830227.17, 2.97, 378, 16, 292, 83, 0, 0, 3, 1, 0, 2, 0, 34, 3, 3, 8, 0, 1, 0, 1, 0, 0, 0, 0, 'A、C、D', 13, 123, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ACEFG', 5, 5, 2019);
INSERT INTO `constru_property` VALUES ('002545', '东方铁塔', 11808806332.11, 11, 2008, 1912, 0.346251, 0.220676, 0.606242, 0.115775, 56009573.79, 2.15, 305, 0, 12, 4, 1, 0, 0, 1, 0, 2, 0, 22, 3, 17, 2, 0, 1, 1, 1, 0, 0, 1, 0, 'A、B、C', 17, 232, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 5, 2019);
INSERT INTO `constru_property` VALUES ('002586', '*ST围海', 9922144587.06, 32, 1987, 1817, 0.570888, 0.346458, -23.712427, -0.324096, 38273388.39, 1.11, 241, 0, 163, 0, 1, 1, 4, 0, 0, 1, 0, 25, 1, 3, 3, 0, 1, 1, 1, 0, 0, 0, 0, 'A、B、D', 7, 97, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BC', 2, 5, 2019);
INSERT INTO `constru_property` VALUES ('002593', '日上集团', 3960482583.52, 22, 1997, 3228, 0.512399, 0.665659, -0.166959, 0.030531, 83218980.39, 3.16, 359, 0, 0, 11, 1, 0, 1, 0, 0, 1, 0, 36, 2, 1, 2, 1, 1, 1, 1, 0, 0, 1, 1, 'A、B、C、D', 19, 181, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'A', 1, 7, 2019);
INSERT INTO `constru_property` VALUES ('002628', '成都路桥', 6946844167.27, 22, 1997, 690, 0.594788, 0.402376, 0.532222, 0.015117, 8938572.9, 0.32, 33, 12, 12, 18, 0, 0, 0, 0, 0, 1, 12, 22, 1, 4, 9, 1, 1, 1, 1, 0, 0, 0, 1, 'A、C', 18, 131, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'AEFG', 4, 3, 2019);
INSERT INTO `constru_property` VALUES ('002663', '普邦股份', 7552631755.6, 25, 1994, 2179, 0.44374, 0.40921, -76.028008, -0.337735, 102237816.23, 3.31, 303, 7, 20, 94, 0, 0, 4, 0, 0, 7, 0, 60, 9, 10, 8, 0, 1, 1, 1, 1, 0, 1, 1, 'A、B、C、D', 17, 151, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BCEG', 4, 7, 2019);
INSERT INTO `constru_property` VALUES ('002717', '岭南股份', 19545770109.79, 10, 2009, 2932, 0.733939, 0.407077, -0.639915, 0.044154, 347442690.89, 4.37, 642, 0, 196, 219, 0, 2, 10, 0, 0, 10, 0, 32, 9, 11, 6, 0, 1, 1, 1, 0, 0, 1, 0, 'A、C、D', 14, 102, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'AEF', 3, 5, 2019);
INSERT INTO `constru_property` VALUES ('002743', '富煌钢构', 7678994231.05, 20, 1999, 2302, 0.712229, 0.487022, 0.245978, 0.024309, 145984945.73, 3.9, 178, 0, 0, 0, 3, 0, 5, 1, 0, 4, 0, 19, 6, 16, 9, 1, 1, 1, 1, 1, 1, 1, 1, 'A、B、C、D', 21, 123, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 7, 2019);
INSERT INTO `constru_property` VALUES ('002761', '浙江建投（数字化典型）', 79323965003.99, 20, 1999, 20412, 0.924608, 0.953677, 360.558384, 0.011922, 154236393.43, 0.2, 3694, 70, 0, 389, 118, 2, 17, 5, 8, 7, 191, 49, 18, 25, 5, 1, 1, 1, 1, 1, 1, 1, 1, 'A、B、C、D', 9, 156, 2, 0, 2, 0, 0, 0, 0, 2, 0, 0, 0, 'ABCDEFG', 7, 7, 2019);
INSERT INTO `constru_property` VALUES ('002775', '文科园林', 4609391665.76, 18, 2001, 1424, 0.433016, 0.628853, -0.191572, 0.08455, 94536844.9, 3.26, 190, 11, 24, 78, 0, 0, 3, 4, 0, 2, 11, 28, 0, 0, 4, 1, 1, 1, 1, 1, 0, 0, 1, 'A、B、C、D', 18, 147, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 7, 2019);
INSERT INTO `constru_property` VALUES ('002941', '新疆交建', 10996460407.61, 16, 2003, 1950, 0.75383, 0.54119, 1.090213, 0.030944, 37040730.21, 0.62, 64, 0, 59, 34, 0, 0, 0, 3, 0, 7, 0, 26, 3, 5, 8, 1, 1, 1, 1, 1, 0, 1, 1, 'A、B、C、D', 15, 144, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ACEFG', 5, 7, 2019);
INSERT INTO `constru_property` VALUES ('300117', '嘉寓股份', 6098650790.55, 11, 2008, 1164, 0.772147, 0.5636, -2.072107, 0.007426, 66802804.34, 1.94, 429, 18, 73, 28, 5, 0, 0, 0, 0, 2, 18, 38, 27, 32, 3, 0, 1, 1, 1, 0, 0, 1, 0, 'A、B、C、D', 35, 279, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BC', 2, 7, 2019);
INSERT INTO `constru_property` VALUES ('300197', '节能铁汉', 29335466866.15, 11, 2008, 2854, 0.764752, 0.1727, -139.888773, -0.182039, 218491070.96, 4.31, 476, 12, 16, 270, 8, 0, 7, 1, 0, 2, 0, 44, 12, 10, 4, 1, 1, 1, 1, 1, 0, 0, 0, 'A、B、D', 24, 151, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BEFG', 4, 5, 2019);
INSERT INTO `constru_property` VALUES ('300237', '美晨生态', 9900914622.21, 18, 2001, 2555, 0.694008, 0.297599, 0, 0.024704, 147187226.43, 4.98, 492, 35, 245, 38, 5, 4, 0, 1, 0, 3, 0, 25, 2, 10, 2, 1, 1, 1, 1, 0, 0, 0, 1, 'A、B、D', 17, 226, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BCDFG', 5, 5, 2019);
INSERT INTO `constru_property` VALUES ('300355', '蒙草生态', 16183249325.13, 25, 1994, 1464, 0.669551, 0.176217, -4.397808, 0.009377, 69941182.78, 2.45, 71, 41, 45, 94, 1, 0, 7, 0, 41, 6, 0, 108, 7, 4, 8, 1, 1, 1, 1, 0, 0, 0, 1, 'A、B、C、D', 21, 71, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CDFG', 4, 7, 2019);
INSERT INTO `constru_property` VALUES ('300384', '三联虹普（数字孪生平台）', 2881824073.9, 17, 2002, 279, 0.349312, 0.291869, -0.255222, 0.222307, 53057576.77, 6.31, 65, 11, 0, 37, 4, 0, 0, 0, 0, 5, 6, 118, 12, 50, 3, 1, 1, 1, 1, 1, 1, 1, 1, 'A、B、C、D', 7, 258, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BC', 2, 7, 2019);
INSERT INTO `constru_property` VALUES ('300495', '*ST美尚', 8040522724.58, 27, 1992, 841, 0.65989, 0.223355, -0.184825, 0.127341, 45507102.39, 2.34, 66, 0, 17, 30, 1, 0, 0, 0, 30, 4, 17, 40, 2, 5, 3, 1, 1, 1, 1, 0, 0, 0, 1, 'A、B、C、D', 17, 141, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CF', 2, 7, 2019);
INSERT INTO `constru_property` VALUES ('300517', '海波重科', 1405323022.55, 11, 2008, 388, 0.486276, 0.519043, -1.775013, 0.035037, 23392968.55, 3.21, 155, 15, 23, 3, 0, 0, 1, 0, 0, 2, 0, 31, 33, 12, 6, 1, 1, 1, 1, 0, 0, 0, 1, 'A、B、C、D', 19, 171, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 7, 2019);
INSERT INTO `constru_property` VALUES ('300536', '农尚环境', 1404934264.58, 13, 2006, 325, 0.564199, 0.329421, -0.525193, 0.113443, 15651175.4, 3.38, 47, 0, 1, 6, 0, 0, 0, 0, 10, 1, 6, 26, 2, 0, 5, 0, 1, 1, 1, 0, 0, 0, 0, 'A、B、D', 13, 147, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CFG', 3, 5, 2019);
INSERT INTO `constru_property` VALUES ('300649', '杭州园林', 976378912.16, 20, 1999, 270, 0.58018, 0.848039, 1.445676, 0.080562, 37398044.64, 4.52, 45, 11, 9, 170, 6, 0, 1, 0, 0, 1, 11, 24, 0, 4, 4, 1, 1, 1, 1, 1, 0, 0, 1, 'A、B、D', 4, 88, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BCFG', 4, 5, 2019);
INSERT INTO `constru_property` VALUES ('300712', '永福股份（数字化能源典型）', 2359506051.2, 19, 2000, 963, 0.576749, 0.610456, 2.062032, 0.051426, 30226859.02, 2.1, 141, 0, 11, 110, 175, 0, 3, 5, 2, 5, 16, 79, 39, 102, 7, 1, 1, 1, 1, 1, 1, 1, 1, 'A、B、C、D', 23, 191, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BCD', 3, 7, 2019);
INSERT INTO `constru_property` VALUES ('600133', '东湖高新', 26643893730.67, 25, 1994, 2487, 0.776981, 0.353672, -0.171564, 0.025832, 65404528.49, 0.69, 321, 0, 70, 215, 2, 0, 0, 0, 0, 4, 0, 70, 2, 5, 3, 1, 1, 1, 1, 1, 1, 0, 0, 'A、B、C、D', 17, 200, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 7, 2019);
INSERT INTO `constru_property` VALUES ('600170', '上海建工', 257280896509.1, 17, 2002, 42762, 0.859403, 0.798725, 0.56931, 0.020985, 6219718567.98, 3.03, 8262, 0, 0, 3639, 0, 0, 4, 6, 0, 0, 0, 41, 1, 9, 11, 1, 1, 1, 1, 1, 0, 0, 1, 'A、B、C、D', 29, 186, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCDEFG', 7, 7, 2019);
INSERT INTO `constru_property` VALUES ('600248', '陕西建工', 8410737494.63, 18, 2001, 4684, 0.648097, 0.959245, 0.302352, 0.03665, 343464079.67, 4.26, 1095, 0, 171, 301, 5, 0, 4, 1, 0, 4, 7, 33, 2, 8, 6, 1, 1, 1, 1, 1, 0, 1, 1, 'A、B、C、D', 7, 59, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 7, 2019);
INSERT INTO `constru_property` VALUES ('600284', '浦东建设', 14484707880.46, 23, 1996, 566, 0.563096, 0.429392, 0.690471, 0.066301, 235890971.67, 3.79, 194, 0, 18, 384, 0, 0, 0, 4, 0, 2, 0, 17, 0, 15, 6, 0, 1, 1, 1, 1, 0, 0, 1, 'A、B、C、D', 8, 67, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 7, 2019);
INSERT INTO `constru_property` VALUES ('600477', '杭萧钢构', 8782703984.22, 24, 1995, 5502, 0.582089, 0.755242, 0.679951, 0.072388, 252394354.38, 3.81, 877, 0, 0, 104, 3, 0, 0, 0, 0, 9, 8, 60, 1, 5, 7, 1, 1, 1, 1, 1, 0, 1, 1, 'A、B、C、D', 12, 146, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCD', 4, 7, 2019);
INSERT INTO `constru_property` VALUES ('600491', '龙元建设', 59445281114.25, 31, 1988, 5116, 0.802801, 0.360451, 1.331239, 0.048225, 73445089.16, 0.34, 274, 0, 87, 477, 2, 0, 0, 3, 0, 6, 0, 48, 8, 10, 3, 1, 1, 1, 1, 1, 0, 1, 1, 'A、B、C、D', 23, 111, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BCFG', 4, 7, 2019);
INSERT INTO `constru_property` VALUES ('600496', '精工钢构', 13765301183.43, 24, 1995, 6487, 0.616216, 0.743569, -0.253236, 0.039079, 402491733.51, 3.93, 1102, 0, 0, 128, 207, 2, 12, 5, 0, 0, 0, 34, 13, 14, 5, 1, 1, 1, 1, 1, 0, 1, 1, 'A、B、C、D', 17, 107, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 7, 2019);
INSERT INTO `constru_property` VALUES ('600502', '安徽建工', 90435503647.1, 21, 1998, 16585, 0.841543, 0.522644, -0.127386, 0.016008, 426243421.26, 0.9, 1985, 0, 470, 0, 39, 1, 17, 0, 0, 43, 0, 35, 9, 17, 4, 1, 1, 1, 1, 1, 0, 1, 1, 'A、B、C、D', 17, 135, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 7, 2019);
INSERT INTO `constru_property` VALUES ('600512', '腾达建设', 10244697333.01, 15, 2004, 3357, 0.551514, 0.426363, -1.556998, 0.154811, 173952648.07, 3.98, 147, 0, 21, 0, 4, 1, 8, 0, 15, 1, 0, 25, 1, 1, 6, 1, 1, 1, 1, 1, 0, 1, 1, 'A、B、C、D', 15, 94, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCEFG', 6, 7, 2019);
INSERT INTO `constru_property` VALUES ('600820', '隧道股份', 90416847277.08, 23, 1996, 11060, 0.741954, 0.482473, 0.503898, 0.049997, 1783300882.8, 4.09, 2260, 0, 91, 1447, 0, 2, 25, 3, 0, 2, 0, 29, 3, 17, 3, 1, 1, 1, 1, 1, 0, 1, 1, 'A、B、C、D', 5, 109, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABCDEFG', 7, 7, 2019);
INSERT INTO `constru_property` VALUES ('600853', '龙建股份', 19743796397.02, 20, 1999, 5671, 0.888649, 0.562525, 0.759661, 0.020355, 13151138.49, 0.12, 709, 0, 24, 86, 2, 1, 6, 2, 0, 3, 0, 28, 0, 1, 4, 1, 1, 1, 1, 1, 0, 0, 1, 'A、B、D', 2, 65, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'AEFG', 4, 5, 2019);
INSERT INTO `constru_property` VALUES ('600939', '重庆建工', 71844640260.56, 18, 2001, 15908, 0.855176, 0.725294, 1.632188, 0.012084, 54518288.4, 0.1, 1720, 0, 857, 0, 94, 1, 1, 0, 0, 2, 0, 24, 7, 15, 6, 0, 1, 0, 1, 1, 0, 0, 0, 'AB', 83, 104, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 'AB', 2, 2, 2019);
INSERT INTO `constru_property` VALUES ('600970', '中材国际', 32906984549.82, 15, 2004, 7794, 0.676544, 0.740706, 0.079319, 0.065358, 610233395.43, 2.5, 1642, 0, 559, 758, 500, 1, 15, 0, 0, 1, 0, 25, 8, 22, 5, 1, 1, 1, 1, 1, 0, 1, 1, 'A', 70, 143, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ACD', 3, 1, 2019);
INSERT INTO `constru_property` VALUES ('601068', '中铝国际', 55999463120.62, 18, 2001, 14685, 0.72508, 0.554644, -0.001119, 0.007164, 861011792.65, 2.77, 2482, 0, 176, 1319, 2, 24, 24, 0, 0, 0, 0, 59, 11, 3, 5, 1, 1, 1, 1, 1, 0, 1, 1, 'A', 128, 187, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BC', 2, 1, 2019);
INSERT INTO `constru_property` VALUES ('601117', '中国化学', 115865390429.46, 18, 2001, 42681, 0.675556, 0.894329, -0.231062, 0.031724, 3316583027.15, 3.2, 1867, 0, 262, 3506, 4, 6, 31, 0, 0, 1, 0, 28, 4, 4, 9, 1, 1, 1, 1, 1, 0, 1, 1, 'A', 86, 160, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'B', 1, 1, 2019);
INSERT INTO `constru_property` VALUES ('601186', '中国铁建', 1081239213000, 19, 2000, 293884, 0.757665, 0.768056, 0.028511, 0.027243, 16527801000, 1.99, 31306, 0, 3349, 12147, 22, 0, 0, 1, 0, 1, 0, 39, 4, 8, 9, 1, 1, 1, 1, 1, 0, 1, 1, 'A', 140, 166, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 'CD', 2, 1, 2019);
INSERT INTO `constru_property` VALUES ('601226', '华电重工', 9167741433.72, 18, 2001, 2454, 0.601414, 0.782709, -0.135442, 0.011639, 280700000, 3.91, 355, 0, 103, 203, 35, 1, 4, 0, 9, 2, 0, 49, 27, 28, 6, 1, 0, 1, 1, 1, 0, 1, 1, 'ABC', 45, 278, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABC', 3, 3, 2019);
INSERT INTO `constru_property` VALUES ('601390', '中国中铁', 1056185927000, 19, 2000, 285405, 0.767584, 0.803306, 0.585832, 0.029912, 16521349000, 1.95, 26893, 0, 12707, 10567, 59, 3, 109, 0, 0, 0, 0, 42, 4, 5, 8, 1, 1, 1, 1, 1, 0, 1, 1, 'A', 147, 216, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ACD', 3, 1, 2019);
INSERT INTO `constru_property` VALUES ('601611', '中国核建', 124459900492.35, 18, 2001, 33617, 0.840543, 0.510956, -0.282115, 0.022358, 807979000.81, 1.27, 4343, 0, 1253, 0, 1, 0, 0, 0, 0, 1, 0, 44, 9, 4, 3, 1, 0, 0, 1, 1, 0, 1, 1, 'ABD', 12, 87, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'A', 1, 3, 2019);
INSERT INTO `constru_property` VALUES ('601618', '中国中冶', 458506213000, 12, 2007, 98566, 0.74503, 0.738567, 1.302344, 0.022374, 9981012000, 2.95, 0, 25, 29700, 11714, 36, 0, 28, 1, 0, 0, 0, 81, 10, 20, 8, 1, 1, 0, 0, 1, 0, 1, 1, 'A', 137, 206, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 'B', 1, 1, 2019);
INSERT INTO `constru_property` VALUES ('601668', '中国建筑', 2034451929000, 21, 1998, 335038, 0.753331, 0.697896, 0.608383, 0.044516, 21871783000, 1.5, 15780, 0, 0, 22772, 451, 0, 39, 2, 6, 3, 0, 54, 6, 30, 5, 1, 1, 1, 1, 1, 0, 1, 1, 'AB', 20, 106, 4, 0, 2, 0, 0, 1, 0, 0, 1, 0, 0, 'CD', 2, 2, 2019);
INSERT INTO `constru_property` VALUES ('601669', '中国电建', 813227622329.43, 20, 1999, 132583, 0.762095, 0.427571, 0.019644, 0.030489, 11298446858.78, 3.25, 24856, 0, 1697, 10559, 2, 0, 53, 0, 3, 3, 0, 35, 2, 4, 5, 1, 1, 1, 1, 1, 0, 1, 1, 'ABC', 15, 96, 7, 0, 5, 0, 5, 0, 0, 0, 0, 0, 0, 'BCD', 3, 3, 2019);
INSERT INTO `constru_property` VALUES ('601789', '宁波建工', 15768762657.39, 26, 1993, 4593, 0.793742, 1.176721, 1.115078, 0.013679, 234918246.66, 1.27, 433, 0, 76, 100, 5, 0, 3, 0, 0, 1, 0, 28, 3, 8, 3, 0, 1, 1, 1, 1, 0, 1, 0, 'A', 17, 89, 6, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 'C', 1, 1, 2019);
INSERT INTO `constru_property` VALUES ('601800', '中国交建', 1120399492938, 21, 1998, 124457, 0.73547, 0.495174, 0.585256, 0.038969, 12647047446, 2.28, 0, 0, 2205, 13365, 52, 0, 80, 0, 0, 1, 0, 45, 6, 15, 6, 1, 1, 1, 1, 1, 0, 1, 1, 'AB', 19, 104, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'C', 1, 2, 2019);
INSERT INTO `constru_property` VALUES ('603007', 'ST花王', 3727181795.25, 26, 1993, 705, 0.663736, 0.331262, 0.122851, 0.074847, 41258799.82, 3.34, 106, 0, 0, 25, 0, 0, 0, 0, 0, 0, 0, 28, 3, 12, 3, 0, 0, 0, 1, 1, 0, 1, 0, 'AB', 13, 59, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BCD', 3, 2, 2019);
INSERT INTO `constru_property` VALUES ('603098', '森特股份', 4708805840.99, 26, 1993, 1053, 0.560736, 0.712826, -0.697559, 0.063121, 124759624.89, 3.72, 209, 0, 128, 28, 3, 1, 2, 0, 1, 0, 0, 24, 2, 1, 3, 1, 0, 1, 1, 0, 0, 1, 1, 'A', 22, 195, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'A', 1, 1, 2019);
INSERT INTO `constru_property` VALUES ('603316', '诚邦股份', 2062668348.94, 12, 2007, 693, 0.574083, 0.439684, -0.402072, 0.034764, 34978408.5, 3.86, 99, 0, 43, 51, 8, 0, 1, 0, 0, 0, 0, 34, 1, 4, 5, 1, 0, 1, 1, 0, 0, 1, 1, 'AB', 14, 94, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABC', 3, 2, 2019);
INSERT INTO `constru_property` VALUES ('603359', '东珠生态', 5969226963.3, 9, 2010, 455, 0.497126, 0.337848, 1.274791, 0.186471, 62334865.66, 3.09, 124, 0, 13, 10, 0, 0, 6, 0, 0, 0, 0, 24, 0, 1, 2, 1, 0, 1, 1, 0, 0, 0, 1, 'A', 9, 102, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'A', 1, 1, 2019);
INSERT INTO `constru_property` VALUES ('603388', '元成股份', 2937720624.41, 10, 2009, 512, 0.634475, 0.343086, 0.316625, 0.135455, 34347185.56, 3.41, 147, 0, 0, 60, 0, 0, 0, 0, 0, 0, 0, 29, 3, 6, 3, 0, 0, 1, 1, 0, 0, 1, 0, 'AB', 48, 86, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BCD', 3, 2, 2019);
INSERT INTO `constru_property` VALUES ('603637', '镇海股份', 1338509416.28, 13, 2006, 346, 0.420434, 0.771764, -0.098519, 0.055664, 31273634.4, 3.03, 87, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 28, 6, 9, 3, 1, 0, 1, 1, 1, 0, 1, 1, 'A', 2, 128, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BCD', 3, 1, 2019);
INSERT INTO `constru_property` VALUES ('603717', '天域生态', 3457126873.63, 5, 2014, 465, 0.580312, 0.242198, 2.535127, 0.073336, 26278323.24, 3.14, 84, 0, 0, 57, 3, 0, 1, 0, 0, 0, 0, 18, 2, 3, 3, 0, 0, 0, 1, 0, 0, 1, 0, 'AB', 11, 65, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CD', 2, 2, 2019);
INSERT INTO `constru_property` VALUES ('603778', '乾景园林', 1719876880.19, 16, 2003, 257, 0.41449, 0.206969, -0.470018, 0.065618, 11707169.35, 3.29, 45, 0, 38, 22, 1, 0, 3, 0, 0, 0, 0, 22, 7, 0, 2, 1, 0, 0, 1, 0, 0, 1, 1, 'A', 21, 83, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BCD', 3, 1, 2019);
INSERT INTO `constru_property` VALUES ('603815', '交建股份', 4939405071.93, 14, 2005, 880, 0.769067, 0.577373, 5.756076, 0.03816, 0, 0, 0, 0, 27, 23, 12, 1, 0, 0, 0, 0, 0, 26, 3, 0, 2, 1, 0, 0, 0, 0, 0, 1, 1, 'A', 6, 53, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ABC', 3, 1, 2019);
INSERT INTO `constru_property` VALUES ('603843', '正平股份', 6587834071.22, 23, 1996, 1665, 0.758408, 0.565986, 0.472929, 0.025763, 6044536.26, 0.16, 8, 0, 113, 33, 19, 0, 3, 0, 0, 0, 0, 33, 12, 2, 6, 1, 0, 0, 0, 0, 0, 1, 1, 'A', 5, 64, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CD', 2, 1, 2019);
INSERT INTO `constru_property` VALUES ('603929', '亚翔集成', 2127093984.86, 18, 2001, 553, 0.451164, 0.878937, -0.513661, 0.054077, 58579948.59, 3.13, 83, 0, 56, 15, 0, 0, 1, 0, 0, 1, 0, 44, 5, 4, 2, 1, 1, 1, 1, 1, 0, 1, 1, 'AB', 9, 95, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CDE', 3, 2, 2019);
INSERT INTO `constru_property` VALUES ('603955', '大千生态', 3347984299.44, 20, 1999, 516, 0.579752, 0.274514, 0.428938, 0.108965, 36379878.93, 3.96, 76, 0, 0, 0, 0, 1, 2, 0, 0, 1, 0, 24, 4, 8, 4, 0, 0, 0, 1, 0, 0, 1, 0, 'AB', 18, 67, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'ACEF', 4, 2, 2019);
INSERT INTO `constru_property` VALUES ('603959', '百利科技', 2741716238.42, 19, 2000, 663, 0.832769, 0.50933, -29.683349, -0.44721, 62503221.18, 4.48, 184, 20, 9, 103, 10, 0, 0, 0, 0, 1, 0, 58, 26, 56, 4, 1, 1, 1, 1, 1, 0, 1, 1, 'AB', 21, 147, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'CDF', 3, 2, 2019);
INSERT INTO `constru_property` VALUES ('603979', '金诚信', 6572393800.82, 17, 2002, 6094, 0.336399, 0.522483, 0.153831, 0.089472, 71294067.75, 2.08, 291, 0, 59, 157, 4, 3, 5, 1, 3, 1, 0, 38, 8, 8, 5, 1, 0, 1, 1, 1, 0, 1, 1, 'AB', 18, 125, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'BCD', 3, 2, 2019);

-- ----------------------------
-- Table structure for constru_structure
-- ----------------------------
DROP TABLE IF EXISTS `constru_structure`;
CREATE TABLE `constru_structure`  (
  `id` int(0) NOT NULL AUTO_INCREMENT,
  `indi_name` varchar(45) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `parent_id` int(0) NULL DEFAULT NULL,
  `level` int(0) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `id_UNIQUE`(`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 71 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of constru_structure
-- ----------------------------
INSERT INTO `constru_structure` VALUES (1, '基本指标', NULL, 1);
INSERT INTO `constru_structure` VALUES (2, '数字化研发创新指标', NULL, 1);
INSERT INTO `constru_structure` VALUES (3, '组织指标', NULL, 1);
INSERT INTO `constru_structure` VALUES (4, '战略指标', NULL, 1);
INSERT INTO `constru_structure` VALUES (5, '特色指标', NULL, 1);
INSERT INTO `constru_structure` VALUES (6, '规模状况', 1, 2);
INSERT INTO `constru_structure` VALUES (7, '财务状况', 1, 2);
INSERT INTO `constru_structure` VALUES (8, '研发状况', 2, 2);
INSERT INTO `constru_structure` VALUES (9, '数字化创新成果状况', 2, 2);
INSERT INTO `constru_structure` VALUES (10, '数字化技术应用状况', 2, 2);
INSERT INTO `constru_structure` VALUES (11, '组织结构', 3, 2);
INSERT INTO `constru_structure` VALUES (12, '承包联合体模式', 3, 2);
INSERT INTO `constru_structure` VALUES (13, '企业战略规划', 4, 2);
INSERT INTO `constru_structure` VALUES (14, '企业战略部门', 4, 2);
INSERT INTO `constru_structure` VALUES (15, '战略影响因素', 4, 2);
INSERT INTO `constru_structure` VALUES (16, '装配式建筑', 5, 2);
INSERT INTO `constru_structure` VALUES (17, '智慧工地', 5, 2);
INSERT INTO `constru_structure` VALUES (18, 'BIM应用', 5, 2);
INSERT INTO `constru_structure` VALUES (19, '施工管理数字化', 5, 2);
INSERT INTO `constru_structure` VALUES (20, '施工设施应用', 5, 2);
INSERT INTO `constru_structure` VALUES (21, '股票代码', 6, 3);
INSERT INTO `constru_structure` VALUES (22, '企业名称', 6, 3);
INSERT INTO `constru_structure` VALUES (23, '总资产', 6, 3);
INSERT INTO `constru_structure` VALUES (24, '企业成立年限', 6, 3);
INSERT INTO `constru_structure` VALUES (25, '成立年份', 6, 3);
INSERT INTO `constru_structure` VALUES (26, '员工总数', 6, 3);
INSERT INTO `constru_structure` VALUES (27, '资产负债率', 7, 3);
INSERT INTO `constru_structure` VALUES (28, '总资产周转率', 7, 3);
INSERT INTO `constru_structure` VALUES (29, '净利润增长率', 7, 3);
INSERT INTO `constru_structure` VALUES (30, '营业净利润率', 7, 3);
INSERT INTO `constru_structure` VALUES (31, '研发投入费用', 8, 3);
INSERT INTO `constru_structure` VALUES (32, '研发投入占营业收入比例(%)', 8, 3);
INSERT INTO `constru_structure` VALUES (33, '研发人员', 8, 3);
INSERT INTO `constru_structure` VALUES (34, '研发项目个数', 8, 3);
INSERT INTO `constru_structure` VALUES (35, '专利数', 8, 3);
INSERT INTO `constru_structure` VALUES (36, '硕士及以上人员数量', 8, 3);
INSERT INTO `constru_structure` VALUES (37, '国家级获奖', 8, 3);
INSERT INTO `constru_structure` VALUES (38, '研发中心数量', 8, 3);
INSERT INTO `constru_structure` VALUES (39, '数字化创新平台数', 9, 3);
INSERT INTO `constru_structure` VALUES (40, '互联网云平台运用数量', 9, 3);
INSERT INTO `constru_structure` VALUES (41, '数字化业务板块数', 9, 3);
INSERT INTO `constru_structure` VALUES (42, '联合高等院校课题研发数', 9, 3);
INSERT INTO `constru_structure` VALUES (43, '成果转化数', 9, 3);
INSERT INTO `constru_structure` VALUES (44, '一级技术词频数', 10, 3);
INSERT INTO `constru_structure` VALUES (45, '二级技术词频数', 10, 3);
INSERT INTO `constru_structure` VALUES (46, '三级技术词频数', 10, 3);
INSERT INTO `constru_structure` VALUES (47, '业务板块数量（多元化情况）', 11, 3);
INSERT INTO `constru_structure` VALUES (48, '组织结构中是否有专门的数字化部门', 11, 3);
INSERT INTO `constru_structure` VALUES (49, '组织内部是否具有专门的项目管理系统', 11, 3);
INSERT INTO `constru_structure` VALUES (50, '是否与数字化类型的企业有合作、收购、投资关系（从年报中获取）', 12, 3);
INSERT INTO `constru_structure` VALUES (51, '是否为国家认定高新技术企业', 12, 3);
INSERT INTO `constru_structure` VALUES (52, '企业年报中是否有提及数字化战略的相关内容？', 13, 3);
INSERT INTO `constru_structure` VALUES (53, '企业年报中是否有专项数字化转型报告', 13, 3);
INSERT INTO `constru_structure` VALUES (54, '企业远景、目标、定位中是否具有数字化、大数据、智能化、信息化等词语', 13, 3);
INSERT INTO `constru_structure` VALUES (55, '企业战略职能中是否具有专门数字化业务部门', 14, 3);
INSERT INTO `constru_structure` VALUES (56, '企业业务中是否运用信息化技术系统', 14, 3);
INSERT INTO `constru_structure` VALUES (57, ' 企业业务中是否运用信息化技术系统个数', 14, 3);
INSERT INTO `constru_structure` VALUES (58, '企业年报中是否有提及“政策”或相关对于数字化转型政策支持的词语', 15, 3);
INSERT INTO `constru_structure` VALUES (59, '企业年报中是否有提及“行业”、“市场”、“需求”或相关对于数字化转型外部驱动的词语', 15, 3);
INSERT INTO `constru_structure` VALUES (60, '装配式建筑项目数', 16, 3);
INSERT INTO `constru_structure` VALUES (61, '完成装配式建筑面积', 16, 3);
INSERT INTO `constru_structure` VALUES (62, '装配式建筑产业基地数量', 16, 3);
INSERT INTO `constru_structure` VALUES (63, '拥有建筑机器人数量', 17, 3);
INSERT INTO `constru_structure` VALUES (64, '智慧工地数量占比', 17, 3);
INSERT INTO `constru_structure` VALUES (65, '5G技术应用工地数量', 17, 3);
INSERT INTO `constru_structure` VALUES (66, '运用BIM技术合同额', 18, 3);
INSERT INTO `constru_structure` VALUES (67, '采用BIM技术项目个数', 18, 3);
INSERT INTO `constru_structure` VALUES (68, '智能建造平台数量', 19, 3);
INSERT INTO `constru_structure` VALUES (69, '采用电子签名/签章项目占比', 19, 3);
INSERT INTO `constru_structure` VALUES (70, '拥有电子化工程档案项目占比', 19, 3);
INSERT INTO `constru_structure` VALUES (71, 'A、智能塔吊', 20, 3);

-- ----------------------------
-- Table structure for design_property
-- ----------------------------
DROP TABLE IF EXISTS `design_property`;
CREATE TABLE `design_property`  (
  `股票代码` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `企业名称` varchar(45) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `总资产` double NOT NULL,
  `企业成立年限` int(0) NOT NULL,
  `成立年份` int(0) NOT NULL,
  `员工总数` int(0) NOT NULL,
  `资产负债率` double NOT NULL,
  `总资产周转率` double NOT NULL,
  `净利润增长率` double NOT NULL,
  `营业净利润率` double NOT NULL,
  `研发投入费用` double NOT NULL,
  `研发投入占营业收入比例(%)` double NOT NULL,
  `研发人员` int(0) NOT NULL,
  `研发项目个数` int(0) NOT NULL,
  `专利数` int(0) NOT NULL,
  `硕士及以上人员数量` int(0) NOT NULL,
  `国家级获奖` int(0) NOT NULL,
  `研发中心数量` double NOT NULL,
  `数字化创新平台数` double NOT NULL,
  `互联网云平台运用数量` double NOT NULL,
  `数字化业务板块数` double NOT NULL,
  `联合高等院校课题研发数` double NOT NULL,
  `成果转化数` double NOT NULL,
  `一级技术词频数` double NOT NULL,
  `二级技术词频数` double NOT NULL,
  `三级技术词频数` double NOT NULL,
  `业务板块数量（多元化情况）` double NOT NULL,
  `组织结构中是否有专门的数字化部门` tinyint(0) NOT NULL,
  `组织内部是否具有专门的项目管理系统` tinyint(0) NOT NULL,
  `是否与数字化类型的企业有合作、收购、投资关系（从年报中获取）` tinyint(0) NOT NULL,
  `是否为国家认定高新技术企业` tinyint(0) NOT NULL,
  `企业年报中是否有提及数字化战略的相关内容？` tinyint(0) NOT NULL,
  `企业年报中是否有专项数字化转型报告` tinyint(0) NOT NULL,
  `企业远景、目标、定位中是否具有数字化、大数据、智能化、信息化等词语` int(0) NOT NULL,
  `企业战略职能中是否具有专门数字化业务部门` tinyint(0) NOT NULL,
  `企业业务中是否运用信息化技术系统` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `企业年报中是否有提及“政策”或相关对于数字化转型政策支持的词语` int(0) NOT NULL,
  `企业年报中是否有提及“行业”、“市场”、“需求”或相关对于数字化转型外部驱动的词语` int(0) NOT NULL,
  `企业业务中是否运用信息化技术系统个数` int(0) NULL DEFAULT NULL,
  `是否收购设计公司或与设计公司合作？` tinyint(0) NOT NULL,
  `是否有公共建筑设计项目？` tinyint(0) NOT NULL,
  `是否有超高层建筑设计项目或复杂性建筑设计项目？` tinyint(0) NOT NULL,
  `是否有装配式建筑设计项目？` tinyint(0) NOT NULL,
  `是否有EPC(工程总承包)项目？` tinyint(0) NOT NULL,
  `是否有协同设计平台？` tinyint(0) NOT NULL,
  `是否为全过程咨询` tinyint(0) NOT NULL,
  `在设计过程中是否使用BIM技术` tinyint(0) NOT NULL,
  `年份` int(0) NOT NULL,
  PRIMARY KEY (`股票代码`) USING BTREE,
  UNIQUE INDEX `股票代码_UNIQUE`(`股票代码`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of design_property
-- ----------------------------
INSERT INTO `design_property` VALUES ('000779', '甘咨询', 3407121355.97, 26, 1989, 3959, 0.267749, 0.464409, 0.627573, 0.174694, 33079585.29, 0.015471, 193, 12, 16, 393, 0, 0, 1, 2, 0, 0, 0, 29, 4, 2, 5, 0, 0, 0, 0, 0, 0, 3, 0, 'A', 9, 85, 1, 1, 0, 0, 0, 0, 0, 1, 1, 2019);
INSERT INTO `design_property` VALUES ('002883', '中设股份', 595935146.78, 34, 1994, 735, 0.09444, 0.171165, 0.523346, 0.23952, 17442329.19, 0.055926, 88, 6, 7, 101, 0, 1, 1, 0, 0, 0, 0, 34, 16, 3, 4, 1, 0, 0, 0, 0, 0, 5, 1, 'AB', 6, 83, 2, 1, 1, 0, 0, 1, 0, 1, 0, 2019);
INSERT INTO `design_property` VALUES ('002949', '华阳国际', 1879356871.43, 28, 1992, 3936, 0.104148, 0.373155, 0.635669, 0.141303, 52563209.36, 0.043999, 410, 3, 53, 492, 2, 0, 0, 2, 1, 0, 0, 29, 3, 1, 6, 1, 1, 1, 1, 1, 0, 5, 1, 'AB', 11, 82, 2, 1, 1, 1, 1, 1, 1, 1, 1, 2019);
INSERT INTO `design_property` VALUES ('300284', '苏交科', 13351138989.14, 19, 2001, 8319, 0.14419, 0.614501, 0.446942, 0.14722, 275514307.61, 0.046172, 1497, 74, 91, 1381, 344, 2, 32, 0, 0, 0, 0, 54, 0, 18, 2, 0, 0, 1, 0, 1, 0, 22, 0, 'AB', 23, 55, 2, 1, 1, 0, 0, 0, 1, 1, 1, 2019);
INSERT INTO `design_property` VALUES ('300492', '华图山鼎', 372274088.22, 19, 1998, 370, -0.209525, 0.21282, 0.574144, 0.10765, 0, 0, 0, 0, 0, 20, 0, 0, 0, 0, 0, 0, 0, 25, 6, 4, 1, 0, 0, 0, 0, 0, 0, 2, 0, 'A', 4, 45, 1, 0, 1, 1, 1, 1, 0, 0, 1, 2019);
INSERT INTO `design_property` VALUES ('300500', '启迪设计', 2500867141.3, 34, 1994, 1599, 0.446234, 0.399374, 0.498669, 0.167311, 64076741.61, 0.051086, 338, 9, 112, 0, 6, 2, 8, 1, 0, 39, 0, 32, 9, 10, 5, 1, 1, 1, 0, 1, 0, 13, 1, 'A', 6, 74, 1, 1, 1, 1, 1, 1, 0, 0, 1, 2019);
INSERT INTO `design_property` VALUES ('300564', '筑博设计', 1685015381.07, 26, 2001, 1859, 0.193301, 0.382708, 0.548452, 0.171806, 40133694.82, 0.043428, 195, 12, 5, 205, 2, 2, 6, 0, 0, 4, 0, 25, 2, 10, 3, 1, 1, 1, 1, 1, 0, 2, 1, 'A', 3, 79, 1, 0, 1, 1, 1, 1, 1, 0, 1, 2019);
INSERT INTO `design_property` VALUES ('300635', '中达安', 1247784511.78, 21, 2001, 3296, 0.059738, 0.453363, 0.452303, 0.153254, 36620191.94, 0.064886, 381, 0, 3, 27, 0, 0, 4, 1, 0, 0, 0, 34, 4, 2, 3, 0, 1, 1, 1, 1, 0, 20, 0, 'AB', 12, 180, 2, 0, 0, 0, 0, 0, 0, 1, 0, 2019);
INSERT INTO `design_property` VALUES ('300668', '杰恩设计', 578875832.68, 17, 1992, 657, 0.005293, 0.145732, 0.673082, 0.251324, 19599931.28, 0.050304, 207, 21, 0, 31, 7, 1, 5, 1, 0, 1, 0, 20, 1, 2, 3, 0, 1, 0, 0, 1, 1, 14, 0, 'AB', 13, 105, 2, 0, 1, 1, 1, 0, 0, 0, 1, 2019);
INSERT INTO `design_property` VALUES ('300675', '建科院', 1057460482.19, 14, 1991, 782, 0.127819, 0.536911, 0.442543, 0.081123, 43128912.23, 0.079893, 169, 51, 84, 208, 1, 2, 14, 2, 0, 15, 0, 34, 5, 9, 2, 1, 1, 0, 1, 1, 0, 7, 1, 'AB', 12, 74, 2, 0, 0, 0, 1, 1, 0, 1, 0, 2019);
INSERT INTO `design_property` VALUES ('300732', '设研院', 4134516829.7, 14, 1988, 2090, -0.095965, 0.451374, 0.381864, 0.199414, 95278194.47, 0.060348, 284, 0, 0, 713, 55, 0, 8, 1, 0, 1, 6, 31, 8, 36, 5, 0, 0, 0, 0, 1, 0, 3, 0, 'A', 54, 127, 1, 1, 1, 1, 1, 1, 1, 0, 1, 2019);
INSERT INTO `design_property` VALUES ('300746', '汉嘉设计', 2424170104.79, 23, 2006, 2199, 0.22168, 0.486535, 0.48716, 0.086919, 45555883.15, 0.038575, 276, 28, 9, 246, 4, 1, 2, 1, 0, 0, 0, 50, 21, 17, 6, 0, 1, 0, 0, 1, 0, 13, 0, 'A', 79, 154, 1, 1, 1, 0, 0, 1, 1, 1, 1, 2019);
INSERT INTO `design_property` VALUES ('300778', '新城市', 1205732058.99, 29, 1998, 890, 0.069778, 0.240048, 0.366818, 0.274482, 17221360.94, 0.038937, 201, 11, 0, 152, 1, 1, 1, 2, 0, 0, 5, 14, 6, 4, 3, 0, 1, 1, 1, 1, 0, 7, 0, 'ABCD', 18, 146, 4, 1, 1, 1, 0, 1, 1, 1, 1, 2019);
INSERT INTO `design_property` VALUES ('600629', '华建集团', 10276905124.34, 29, 1999, 8445, 0.039354, 0.679471, 0.701475, 0.045961, 278352181, 0.03772, 499, 0, 0, 0, 0, 1, 2, 11, 4, 0, 0, 19, 0, 2, 4, 1, 1, 1, 1, 1, 0, 23, 1, 'ABD', 12, 162, 3, 1, 1, 1, 1, 1, 1, 1, 1, 2019);
INSERT INTO `design_property` VALUES ('603017', '中衡设计', 3539177895.47, 27, 1999, 3452, 0.185944, 0.453365, 0.54881, 0.126128, 88139782.11, 0.045378, 429, 0, 0, 417, 20, 0, 1, 0, 0, 0, 0, 52, 4, 2, 4, 0, 0, 1, 0, 0, 0, 6, 0, 'A', 9, 64, 1, 1, 1, 1, 1, 1, 0, 1, 0, 2019);
INSERT INTO `design_property` VALUES ('603018', '中设集团', 8074368191.32, 16, 2001, 5254, 0.3129, 0.636927, 0.580654, 0.131611, 191415983.08, 0.040827, 891, 0, 0, 1767, 0, 5, 9, 6, 1, 9, 0, 33, 1, 14, 7, 1, 1, 1, 1, 1, 0, 27, 1, 'ABCD', 23, 179, 4, 1, 1, 1, 1, 1, 1, 1, 1, 2019);
INSERT INTO `design_property` VALUES ('603357', '设计总院', 93384983814.64, 28, 2003, 1750, -0.255525, 0.305241, 0.47832, 0.234288, 69245882.59, 0.042768, 289, 0, 19, 667, 17, 1, 3, 1, 0, 0, 0, 29, 5, 1, 3, 0, 1, 1, 1, 1, 0, 26, 0, 'AB', 109, 175, 2, 1, 1, 1, 1, 1, 1, 1, 1, 2019);
INSERT INTO `design_property` VALUES ('603458', '勘设股份', 5952625075.96, 12, 2008, 3145, 0.225646, 0.557025, 0.430618, 0.198412, 84277158.59, 0.032878, 433, 0, 28, 508, 14, 0, 1, 1, 0, 2, 4, 24, 12, 25, 2, 1, 1, 0, 0, 1, 0, 19, 1, 'A', 14, 105, 1, 1, 1, 1, 0, 1, 0, 1, 1, 2019);
INSERT INTO `design_property` VALUES ('603860', '中公高科', 755278845.33, 14, 2008, 213, 0.164992, 0.142632, 0.287025, 0.2994, 150259501200, 0.069313, 42, 40, 44, 71, 1, 0, 1, 6, 5, 0, 1, 34, 3, 3, 7, 1, 1, 1, 1, 1, 0, 16, 1, 'A', 15, 178, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2019);
INSERT INTO `design_property` VALUES ('603909', '合诚股份', 1430130634.85, 26, 2008, 2183, 0.117348, 0.412917, 0.533115, 0.119904, 28039415.09, 0.033466, 228, 0, 28, 0, 20, 1, 4, 0, 1, 0, 0, 22, 3, 17, 5, 1, 1, 1, 1, 1, 0, 8, 1, 'A', 7, 123, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2019);

-- ----------------------------
-- Table structure for design_structure
-- ----------------------------
DROP TABLE IF EXISTS `design_structure`;
CREATE TABLE `design_structure`  (
  `id` int(0) NOT NULL AUTO_INCREMENT,
  `indi_name` varchar(45) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `parent_id` int(0) NULL DEFAULT NULL,
  `level` int(0) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `id_UNIQUE`(`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 74 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of design_structure
-- ----------------------------
INSERT INTO `design_structure` VALUES (1, '基本指标', NULL, 1);
INSERT INTO `design_structure` VALUES (2, '数字化研发创新指标', NULL, 1);
INSERT INTO `design_structure` VALUES (3, '组织指标', NULL, 1);
INSERT INTO `design_structure` VALUES (4, '战略指标', NULL, 1);
INSERT INTO `design_structure` VALUES (5, '特色指标', NULL, 1);
INSERT INTO `design_structure` VALUES (6, '规模状况', 1, 2);
INSERT INTO `design_structure` VALUES (7, '财务状况', 1, 2);
INSERT INTO `design_structure` VALUES (8, '研发状况', 2, 2);
INSERT INTO `design_structure` VALUES (9, '数字化创新成果状况', 2, 2);
INSERT INTO `design_structure` VALUES (10, '数字化技术应用状况', 2, 2);
INSERT INTO `design_structure` VALUES (11, '组织结构', 3, 2);
INSERT INTO `design_structure` VALUES (12, '承包联合体模式', 3, 2);
INSERT INTO `design_structure` VALUES (13, '企业战略规划', 4, 2);
INSERT INTO `design_structure` VALUES (14, '企业战略部门', 4, 2);
INSERT INTO `design_structure` VALUES (15, '战略影响因素', 4, 2);
INSERT INTO `design_structure` VALUES (16, '设计合作', 5, 2);
INSERT INTO `design_structure` VALUES (17, '设计项目', 5, 2);
INSERT INTO `design_structure` VALUES (18, '设计工具', 5, 2);
INSERT INTO `design_structure` VALUES (19, '股票代码', 6, 3);
INSERT INTO `design_structure` VALUES (20, '企业名称', 6, 3);
INSERT INTO `design_structure` VALUES (21, '总资产', 6, 3);
INSERT INTO `design_structure` VALUES (22, '企业成立年限', 6, 3);
INSERT INTO `design_structure` VALUES (23, '成立年份', 6, 3);
INSERT INTO `design_structure` VALUES (24, '员工总数', 6, 3);
INSERT INTO `design_structure` VALUES (25, '资产负债率', 7, 3);
INSERT INTO `design_structure` VALUES (26, '总资产周转率', 7, 3);
INSERT INTO `design_structure` VALUES (27, '净利润增长率', 7, 3);
INSERT INTO `design_structure` VALUES (28, '营业净利润率', 7, 3);
INSERT INTO `design_structure` VALUES (29, '研发投入费用', 8, 3);
INSERT INTO `design_structure` VALUES (30, '研发投入占营业收入比例(%)', 8, 3);
INSERT INTO `design_structure` VALUES (31, '研发人员', 8, 3);
INSERT INTO `design_structure` VALUES (32, '研发项目个数', 8, 3);
INSERT INTO `design_structure` VALUES (33, '专利数', 8, 3);
INSERT INTO `design_structure` VALUES (34, '硕士及以上人员数量', 8, 3);
INSERT INTO `design_structure` VALUES (35, '国家级获奖', 8, 3);
INSERT INTO `design_structure` VALUES (36, '研发中心数量', 8, 3);
INSERT INTO `design_structure` VALUES (37, '数字化创新平台数', 9, 3);
INSERT INTO `design_structure` VALUES (38, '互联网云平台运用数量', 9, 3);
INSERT INTO `design_structure` VALUES (39, '数字化业务板块数', 9, 3);
INSERT INTO `design_structure` VALUES (40, '联合高等院校课题研发数', 9, 3);
INSERT INTO `design_structure` VALUES (41, '成果转化数', 9, 3);
INSERT INTO `design_structure` VALUES (42, '一级技术词频数', 10, 3);
INSERT INTO `design_structure` VALUES (43, '二级技术词频数', 10, 3);
INSERT INTO `design_structure` VALUES (44, '三级技术词频数', 10, 3);
INSERT INTO `design_structure` VALUES (45, '业务板块数量（多元化情况）', 11, 3);
INSERT INTO `design_structure` VALUES (46, '组织结构中是否有专门的数字化部门', 11, 3);
INSERT INTO `design_structure` VALUES (47, '组织内部是否具有专门的项目管理系统', 11, 3);
INSERT INTO `design_structure` VALUES (48, '是否与数字化类型的企业有合作、收购、投资关系（从年报中获取）', 12, 3);
INSERT INTO `design_structure` VALUES (49, '是否为国家认定高新技术企业', 12, 3);
INSERT INTO `design_structure` VALUES (50, '企业年报中是否有提及数字化战略的相关内容？', 13, 3);
INSERT INTO `design_structure` VALUES (51, '企业年报中是否有专项数字化转型报告', 13, 3);
INSERT INTO `design_structure` VALUES (52, '企业远景、目标、定位中是否具有数字化、大数据、智能化、信息化等词语', 13, 3);
INSERT INTO `design_structure` VALUES (53, '企业战略职能中是否具有专门数字化业务部门', 14, 3);
INSERT INTO `design_structure` VALUES (54, '企业业务中是否运用信息化技术系统', 14, 3);
INSERT INTO `design_structure` VALUES (55, '企业业务中是否运用信息化技术系统个数', 14, 3);
INSERT INTO `design_structure` VALUES (56, '企业年报中是否有提及“政策”或相关对于数字化转型政策支持的词语', 15, 3);
INSERT INTO `design_structure` VALUES (57, '企业年报中是否有提及“行业”、“市场”、“需求”或相关对于数字化转型外部驱动的词语', 15, 3);
INSERT INTO `design_structure` VALUES (58, '是否收购设计公司或与设计公司合作？', 16, 3);
INSERT INTO `design_structure` VALUES (59, '是否有公共建筑设计项目？', 17, 3);
INSERT INTO `design_structure` VALUES (60, '是否有超高层建筑设计项目或复杂性建筑设计项目？', 17, 3);
INSERT INTO `design_structure` VALUES (61, '是否有装配式建筑设计项目？', 17, 3);
INSERT INTO `design_structure` VALUES (62, '是否有EPC(工程总承包)项目？', 17, 3);
INSERT INTO `design_structure` VALUES (63, '是否有协同设计平台？', 18, 3);
INSERT INTO `design_structure` VALUES (64, '是否为全过程咨询', 18, 3);
INSERT INTO `design_structure` VALUES (65, '在设计过程中是否使用BIM技术', 18, 3);

SET FOREIGN_KEY_CHECKS = 1;
